docs: extensive docs (#322)
